In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
import matplotlib.pyplot as plt

In [4]:
import seaborn as sns

In [5]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [6]:
from sklearn.model_selection import train_test_split

In [7]:
from sklearn.preprocessing import StandardScaler
ss=StandardScaler()

In [8]:
from sklearn import metrics

In [9]:
df=pd.read_excel('titanic3.xls')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [10]:
df.shape

(1309, 14)

In [11]:
df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [13]:
df.isna().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [14]:
df.drop(['cabin','name','home.dest','boat','body'],axis=1,inplace=True)

In [15]:
df.isna().sum()

pclass        0
survived      0
sex           0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [16]:
df.groupby('survived').size()

survived
0    809
1    500
dtype: int64

In [17]:
df.groupby('embarked').size()

embarked
C    270
Q    123
S    914
dtype: int64

In [18]:
df.embarked.fillna('S',inplace=True)

In [19]:
df.age.fillna(df.age.median(),inplace=True)

In [20]:
df.fare.fillna(df.fare.median(),inplace=True)

In [21]:
df.isna().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64

In [22]:
dfle=df
dfle.age= le.fit_transform(dfle.age)
dfle.embarked= le.fit_transform(dfle.embarked)
dfle.sex=le.fit_transform(dfle.sex)
dfle

      pclass  survived  sex  age  sibsp  parch  ticket      fare  embarked
0          1         1    0   44      0      0   24160  211.3375         2
1          1         1    1    6      1      2  113781  151.5500         2
2          1         0    0    8      1      2  113781  151.5500         2
3          1         0    1   45      1      2  113781  151.5500         2
4          1         0    0   38      1      2  113781  151.5500         2
...      ...       ...  ...  ...    ...    ...     ...       ...       ...
1304       3         0    0   22      1      0    2665   14.4542         0
1305       3         0    0   42      1      0    2665   14.4542         0
1306       3         0    1   40      0      0    2656    7.2250         0
1307       3         0    1   41      0      0    2670    7.2250         0
1308       3         0    1   44      0      0  315082    7.8750         2

[1309 rows x 9 columns]

In [23]:
x=df.drop(['survived','ticket'],axis=1)

In [24]:
y=df.survived

In [25]:
x_train,x_test,y_train,y_test=train_test_split(x,y,train_size=0.7,random_state=10)

In [26]:
print(x_train.shape,x_test.shape,y_train.shape,y_test.shape)

(916, 7) (393, 7) (916,) (393,)

In [27]:
from sklearn.linear_model import LogisticRegression
logr=LogisticRegression(class_weight={1:0.38197097, 0: 0.61802903},solver='liblinear')

from sklearn.svm import SVC
svc=SVC(kernel='linear',class_weight={1:0.38197097, 0: 0.61802903})

from sklearn.neighbors import KNeighborsClassifier
knc=KNeighborsClassifier(n_neighbors=10)

from sklearn.ensemble import RandomForestClassifier
rfc=RandomForestClassifier(max_depth=4,random_state=0,class_weight={1:0.38197097, 0: 0.61802903})

from sklearn.tree import DecisionTreeClassifier
dtc=DecisionTreeClassifier(class_weight={1:0.38197097, 0: 0.61802903})

In [28]:
classifiers=[logr,svc,knc,rfc,dtc]

In [29]:
full_results=dict()
for classifier in classifiers:
    classifier.fit(x_train,y_train)
    y_pred=classifier.predict(x_test)
    accuracy=metrics.accuracy_score(y_test,y_pred)
    f1_score=metrics.f1_score(y_test, y_pred)
    full_results[str(classifier)]=f1_score
    print(f'accuracy of {str(classifier)}:{accuracy:.2%}')
    print(f'F1 score: {f1_score:.3f}')
    print("")
full_results[str(classifier)]=f1_score
max_f1_score=max(full_results.items(),key=lambda x:x[1])
print(max_f1_score)

accuracy of LogisticRegression(class_weight={0: 0.61802903, 1: 0.38197097},
                   solver='liblinear'):78.63%
F1 score: 0.659

accuracy of SVC(class_weight={0: 0.61802903, 1: 0.38197097}, kernel='linear'):76.84%
F1 score: 0.669

accuracy of KNeighborsClassifier(n_neighbors=10):68.19%
F1 score: 0.481

accuracy of RandomForestClassifier(class_weight={0: 0.61802903, 1: 0.38197097}, max_depth=4,
                       random_state=0):78.12%
F1 score: 0.619

accuracy of DecisionTreeClassifier(class_weight={0: 0.61802903, 1: 0.38197097}):75.83%
F1 score: 0.671

('DecisionTreeClassifier(class_weight={0: 0.61802903, 1: 0.38197097})', 0.671280276816609)